# SetGlobal3DOriginHandle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..SetGlobal3DOriginHandle Method
ExporterIFCUtils Class See Also
---
Sets the handle representing the 3D origin.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static void SetGlobal3DOriginHandle(
	IFCAnyHandle origin
)
```

Visual Basic
---
```text
Public Shared Sub SetGlobal3DOriginHandle ( _
	origin As IFCAnyHandle _
)
```

Visual C++
---
```text
public:
static void SetGlobal3DOriginHandle(
	IFCAnyHandle^ origin
)
```

# ### Parameters
origin
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The origin handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace